HAMES2-1st-3/TunnelComfortSystemTesting/include/tc26xa/IfxEth_bf.h
/** \\brief  Offset for Ifx_ETH_MMC_IPC_RECEIVE_INTERRUPT_Bits.RXICMPGOIS */
#define IFX_ETH_MMC_IPC_RECEIVE_INTERRUPT_RXICMPGOIS_OFF (28)

/** \\brief  Length for Ifx_ETH_MMC_IPC_RECEIVE_INTERRUPT_Bits.RXIPV4FRAGFIS */
#define IFX_ETH_MMC_IPC_RECEIVE_INTERRUPT_RXIPV4FRAGFIS_LEN (1)

/** \\brief  Mask for Ifx_ETH_MMC_IPC_RECEIVE_INTERRUPT_Bits.RXIPV4FRAGFIS */
#define IFX_ETH_MMC_IPC_RECEIVE_INTERRUPT_RXIPV4FRAGFIS_MSK (0x1)

/** \\brief  Offset for Ifx_ETH_MMC_IPC_RECEIVE_INTERRUPT_Bits.RXIPV4FRAGFIS */
#define IFX_ETH_MMC_IPC_RECEIVE_INTERRUPT_RXIPV4FRAGFIS_OFF (3)

/** \\brief  Length for Ifx_ETH_MMC_IPC_RECEIVE_INTERRUPT_Bits.RXIPV4FRAGOIS */
#define IFX_ETH_MMC_IPC_RECEIVE_INTERRUPT_RXIPV4FRAGOIS_LEN (1)

/** \\brief  Mask for Ifx_ETH_MMC_IPC_RECEIVE_INTERRUPT_Bits.RXIPV4FRAGOIS */
#define IFX_ETH_MMC_IPC_RECEIVE_INTERRUPT_RXIPV4FRAGOIS_MSK (0x1)

/** \\brief  Offset for Ifx_ETH_MMC_IPC_RECEIVE_INTERRUPT_Bits.RXIPV4FRAGOIS */
#define IFX_ETH_MMC_IPC_RECEIVE_INTERRUPT_RXIPV4FRAGOIS_OFF (19)

/** \\brief  Length for Ifx_ETH_MMC_IPC_RECEIVE_INTERRUPT_Bits.RXIPV4GFIS */
#define IFX_ETH_MMC_IPC_RECEIVE_INTERRUPT_RXIPV4GFIS_LEN (1)

/** \\brief  Mask for Ifx_ETH_MMC_IPC_RECEIVE_INTERRUPT_Bits.RXIPV4GFIS */
#define IFX_ETH_MMC_IPC_RECEIVE_INTERRUPT_RXIPV4GFIS_MSK (0x1)

/** \\brief  Offset for Ifx_ETH_MMC_IPC_RECEIVE_INTERRUPT_Bits.RXIPV4GFIS */
#define IFX_ETH_MMC_IPC_RECEIVE_INTERRUPT_RXIPV4GFIS_OFF (0)

/** \\brief  Length for Ifx_ETH_MMC_IPC_RECEIVE_INTERRUPT_Bits.RXIPV4GOIS */
#define IFX_ETH_MMC_IPC_RECEIVE_INTERRUPT_RXIPV4GOIS_LEN (1)

/** \\brief  Mask for Ifx_ETH_MMC_IPC_RECEIVE_INTERRUPT_Bits.RXIPV4GOIS */
#define IFX_ETH_MMC_IPC_RECEIVE_INTERRUPT_RXIPV4GOIS_MSK (0x1)

/** \\brief  Offset for Ifx_ETH_MMC_IPC_RECEIVE_INTERRUPT_Bits.RXIPV4GOIS */
#define IFX_ETH_MMC_IPC_RECEIVE_INTERRUPT_RXIPV4GOIS_OFF (16)

/** \\brief  Length for Ifx_ETH_MMC_IPC_RECEIVE_INTERRUPT_Bits.RXIPV4HERFIS */
#define IFX_ETH_MMC_IPC_RECEIVE_INTERRUPT_RXIPV4HERFIS_LEN (1)

/** \\brief  Mask for Ifx_ETH_MMC_IPC_RECEIVE_INTERRUPT_Bits.RXIPV4HERFIS */
#define IFX_ETH_MMC_IPC_RECEIVE_INTERRUPT_RXIPV4HERFIS_MSK (0x1)

/** \\brief  Offset for Ifx_ETH_MMC_IPC_RECEIVE_INTERRUPT_Bits.RXIPV4HERFIS */
#define IFX_ETH_MMC_IPC_RECEIVE_INTERRUPT_RXIPV4HERFIS_OFF (1)

/** \\brief  Length for Ifx_ETH_MMC_IPC_RECEIVE_INTERRUPT_Bits.RXIPV4HEROIS */
#define IFX_ETH_MMC_IPC_RECEIVE_INTERRUPT_RXIPV4HEROIS_LEN (1)

/** \\brief  Mask for Ifx_ETH_MMC_IPC_RECEIVE_INTERRUPT_Bits.RXIPV4HEROIS */
#define IFX_ETH_MMC_IPC_RECEIVE_INTERRUPT_RXIPV4HEROIS_MSK (0x1)

/** \\brief  Offset for Ifx_ETH_MMC_IPC_RECEIVE_INTERRUPT_Bits.RXIPV4HEROIS */
#define IFX_ETH_MMC_IPC_RECEIVE_INTERRUPT_RXIPV4HEROIS_OFF (17)

/** \\brief  Length for Ifx_ETH_MMC_IPC_RECEIVE_INTERRUPT_Bits.RXIPV4NOPAYFIS */
#define IFX_ETH_MMC_IPC_RECEIVE_INTERRUPT_RXIPV4NOPAYFIS_LEN (1)

/** \\brief  Mask for Ifx_ETH_MMC_IPC_RECEIVE_INTERRUPT_Bits.RXIPV4NOPAYFIS */
#define IFX_ETH_MMC_IPC_RECEIVE_INTERRUPT_RXIPV4NOPAYFIS_MSK (0x1)

/** \\brief  Offset for Ifx_ETH_MMC_IPC_RECEIVE_INTERRUPT_Bits.RXIPV4NOPAYFIS */
#define IFX_ETH_MMC_IPC_RECEIVE_INTERRUPT_RXIPV4NOPAYFIS_OFF (2)

/** \\brief  Length for Ifx_ETH_MMC_IPC_RECEIVE_INTERRUPT_Bits.RXIPV4NOPAYOIS */
#define IFX_ETH_MMC_IPC_RECEIVE_INTERRUPT_RXIPV4NOPAYOIS_LEN (1)

/** \\brief  Mask for Ifx_ETH_MMC_IPC_RECEIVE_INTERRUPT_Bits.RXIPV4NOPAYOIS */
#define IFX_ETH_MMC_IPC_RECEIVE_INTERRUPT_RXIPV4NOPAYOIS_MSK (0x1)

/** \\brief  Offset for Ifx_ETH_MMC_IPC_RECEIVE_INTERRUPT_Bits.RXIPV4NOPAYOIS */
#define IFX_ETH_MMC_IPC_RECEIVE_INTERRUPT_RXIPV4NOPAYOIS_OFF (18)

/** \\brief  Length for Ifx_ETH_MMC_IPC_RECEIVE_INTERRUPT_Bits.RXIPV4UDSBLFIS */
#define IFX_ETH_MMC_IPC_RECEIVE_INTERRUPT_RXIPV4UDSBLFIS_LEN (1)

/** \\brief  Mask for Ifx_ETH_MMC_IPC_RECEIVE_INTERRUPT_Bits.RXIPV4UDSBLFIS */
#define IFX_ETH_MMC_IPC_RECEIVE_INTERRUPT_RXIPV4UDSBLFIS_MSK (0x1)

/** \\brief  Offset for Ifx_ETH_MMC_IPC_RECEIVE_INTERRUPT_Bits.RXIPV4UDSBLFIS */
#define IFX_ETH_MMC_IPC_RECEIVE_INTERRUPT_RXIPV4UDSBLFIS_OFF (4)

/** \\brief  Length for Ifx_ETH_MMC_IPC_RECEIVE_INTERRUPT_Bits.RXIPV4UDSBLOIS */
#define IFX_ETH_MMC_IPC_RECEIVE_INTERRUPT_RXIPV4UDSBLOIS_LEN (1)

/** \\brief  Mask for Ifx_ETH_MMC_IPC_RECEIVE_INTERRUPT_Bits.RXIPV4UDSBLOIS */
#define IFX_ETH_MMC_IPC_RECEIVE_INTERRUPT_RXIPV4UDSBLOIS_MSK (0x1)

/** \\brief  Offset for Ifx_ETH_MMC_IPC_RECEIVE_INTERRUPT_Bits.RXIPV4UDSBLOIS */
#define IFX_ETH_MMC_IPC_RECEIVE_INTERRUPT_RXIPV4UDSBLOIS_OFF (20)

/** \\brief  Length for Ifx_ETH_MMC_IPC_RECEIVE_INTERRUPT_Bits.RXIPV6GFIS */
#define IFX_ETH_MMC_IPC_RECEIVE_INTERRUPT_RXIPV6GFIS_LEN (1)

/** \\brief  Mask for Ifx_ETH_MMC_IPC_RECEIVE_INTERRUPT_Bits.RXIPV6GFIS */
#define IFX_ETH_MMC_IPC_RECEIVE_INTERRUPT_RXIPV6GFIS_MSK (0x1)

/** \\brief  Offset for Ifx_ETH_MMC_IPC_RECEIVE_INTERRUPT_Bits.RXIPV6GFIS */
#define IFX_ETH_MMC_IPC_RECEIVE_INTERRUPT_RXIPV6GFIS_OFF (5)

/** \\brief  Length for Ifx_ETH_MMC_IPC_RECEIVE_INTERRUPT_Bits.RXIPV6GOIS */
#define IFX_ETH_MMC_IPC_RECEIVE_INTERRUPT_RXIPV6GOIS_LEN (1)

/** \\brief  Mask for Ifx_ETH_MMC_IPC_RECEIVE_INTERRUPT_Bits.RXIPV6GOIS */
#define IFX_ETH_MMC_IPC_RECEIVE_INTERRUPT_RXIPV6GOIS_MSK (0x1)

/** \\brief  Offset for Ifx_ETH_MMC_IPC_RECEIVE_INTERRUPT_Bits.RXIPV6GOIS */
#define IFX_ETH_MMC_IPC_RECEIVE_INTERRUPT_RXIPV6GOIS_OFF (21)

/** \\brief  Length for Ifx_ETH_MMC_IPC_RECEIVE_INTERRUPT_Bits.RXIPV6HERFIS */
#define IFX_ETH_MMC_IPC_RECEIVE_INTERRUPT_RXIPV6HERFIS_LEN (1)

/** \\brief  Mask for Ifx_ETH_MMC_IPC_RECEIVE_INTERRUPT_Bits.RXIPV6HERFIS */
#define IFX_ETH_MMC_IPC_RECEIVE_INTERRUPT_RXIPV6HERFIS_MSK (0x1)

/** \\brief  Offset for Ifx_ETH_MMC_IPC_RECEIVE_INTERRUPT_Bits.RXIPV6HERFIS */
#define IFX_ETH_MMC_IPC_RECEIVE_INTERRUPT_RXIPV6HERFIS_OFF (6)

/** \\brief  Length for Ifx_ETH_MMC_IPC_RECEIVE_INTERRUPT_Bits.RXIPV6HEROIS */
#define IFX_ETH_MMC_IPC_RECEIVE_INTERRUPT_RXIPV6HEROIS_LEN (1)

/** \\brief  Mask for Ifx_ETH_MMC_IPC_RECEIVE_INTERRUPT_Bits.RXIPV6HEROIS */
#define IFX_ETH_MMC_IPC_RECEIVE_INTERRUPT_RXIPV6HEROIS_MSK (0x1)

