HAMES2-1st-3/TunnelComfortSystemTesting/include/tc26xa/IfxEth_bf.h
/** \\brief  Length for Ifx_ETH_RXIPV4_NO_PAYLOAD_FRAMES_Bits.RXIPV4NOPAYFRM */
#define IFX_ETH_RXIPV4_NO_PAYLOAD_FRAMES_RXIPV4NOPAYFRM_LEN (32)

/** \\brief  Mask for Ifx_ETH_RXIPV4_NO_PAYLOAD_FRAMES_Bits.RXIPV4NOPAYFRM */
#define IFX_ETH_RXIPV4_NO_PAYLOAD_FRAMES_RXIPV4NOPAYFRM_MSK (0xffffffff)

/** \\brief  Offset for Ifx_ETH_RXIPV4_NO_PAYLOAD_FRAMES_Bits.RXIPV4NOPAYFRM */
#define IFX_ETH_RXIPV4_NO_PAYLOAD_FRAMES_RXIPV4NOPAYFRM_OFF (0)

/** \\brief  Length for Ifx_ETH_RXIPV4_NO_PAYLOAD_OCTETS_Bits.RXIPV4NOPAYOCT */
#define IFX_ETH_RXIPV4_NO_PAYLOAD_OCTETS_RXIPV4NOPAYOCT_LEN (32)

/** \\brief  Mask for Ifx_ETH_RXIPV4_NO_PAYLOAD_OCTETS_Bits.RXIPV4NOPAYOCT */
#define IFX_ETH_RXIPV4_NO_PAYLOAD_OCTETS_RXIPV4NOPAYOCT_MSK (0xffffffff)

/** \\brief  Offset for Ifx_ETH_RXIPV4_NO_PAYLOAD_OCTETS_Bits.RXIPV4NOPAYOCT */
#define IFX_ETH_RXIPV4_NO_PAYLOAD_OCTETS_RXIPV4NOPAYOCT_OFF (0)

/** \\brief  Length for
 * Ifx_ETH_RXIPV4_UDP_CHECKSUM_DISABLE_OCTETS_Bits.RXIPV4UDSBLOCT */
#define IFX_ETH_RXIPV4_UDP_CHECKSUM_DISABLE_OCTETS_RXIPV4UDSBLOCT_LEN (32)

/** \\brief  Mask for
 * Ifx_ETH_RXIPV4_UDP_CHECKSUM_DISABLE_OCTETS_Bits.RXIPV4UDSBLOCT */
#define IFX_ETH_RXIPV4_UDP_CHECKSUM_DISABLE_OCTETS_RXIPV4UDSBLOCT_MSK (0xffffffff)

/** \\brief  Offset for
 * Ifx_ETH_RXIPV4_UDP_CHECKSUM_DISABLE_OCTETS_Bits.RXIPV4UDSBLOCT */
#define IFX_ETH_RXIPV4_UDP_CHECKSUM_DISABLE_OCTETS_RXIPV4UDSBLOCT_OFF (0)

/** \\brief  Length for
 * Ifx_ETH_RXIPV4_UDP_CHECKSUM_DISABLED_FRAMES_Bits.RXIPV4UDSBLFRM */
#define IFX_ETH_RXIPV4_UDP_CHECKSUM_DISABLED_FRAMES_RXIPV4UDSBLFRM_LEN (32)

/** \\brief  Mask for
 * Ifx_ETH_RXIPV4_UDP_CHECKSUM_DISABLED_FRAMES_Bits.RXIPV4UDSBLFRM */
#define IFX_ETH_RXIPV4_UDP_CHECKSUM_DISABLED_FRAMES_RXIPV4UDSBLFRM_MSK (0xffffffff)

/** \\brief  Offset for
 * Ifx_ETH_RXIPV4_UDP_CHECKSUM_DISABLED_FRAMES_Bits.RXIPV4UDSBLFRM */
#define IFX_ETH_RXIPV4_UDP_CHECKSUM_DISABLED_FRAMES_RXIPV4UDSBLFRM_OFF (0)

/** \\brief  Length for Ifx_ETH_RXIPV6_GOOD_FRAMES_Bits.RXIPV6GDFRM */
#define IFX_ETH_RXIPV6_GOOD_FRAMES_RXIPV6GDFRM_LEN (32)

/** \\brief  Mask for Ifx_ETH_RXIPV6_GOOD_FRAMES_Bits.RXIPV6GDFRM */
#define IFX_ETH_RXIPV6_GOOD_FRAMES_RXIPV6GDFRM_MSK (0xffffffff)

/** \\brief  Offset for Ifx_ETH_RXIPV6_GOOD_FRAMES_Bits.RXIPV6GDFRM */
#define IFX_ETH_RXIPV6_GOOD_FRAMES_RXIPV6GDFRM_OFF (0)

/** \\brief  Length for Ifx_ETH_RXIPV6_GOOD_OCTETS_Bits.RXIPV6GDOCT */
#define IFX_ETH_RXIPV6_GOOD_OCTETS_RXIPV6GDOCT_LEN (32)

/** \\brief  Mask for Ifx_ETH_RXIPV6_GOOD_OCTETS_Bits.RXIPV6GDOCT */
#define IFX_ETH_RXIPV6_GOOD_OCTETS_RXIPV6GDOCT_MSK (0xffffffff)

/** \\brief  Offset for Ifx_ETH_RXIPV6_GOOD_OCTETS_Bits.RXIPV6GDOCT */
#define IFX_ETH_RXIPV6_GOOD_OCTETS_RXIPV6GDOCT_OFF (0)

/** \\brief  Length for Ifx_ETH_RXIPV6_HEADER_ERROR_FRAMES_Bits.RXIPV6HDRERRFRM */
#define IFX_ETH_RXIPV6_HEADER_ERROR_FRAMES_RXIPV6HDRERRFRM_LEN (32)

/** \\brief  Mask for Ifx_ETH_RXIPV6_HEADER_ERROR_FRAMES_Bits.RXIPV6HDRERRFRM */
#define IFX_ETH_RXIPV6_HEADER_ERROR_FRAMES_RXIPV6HDRERRFRM_MSK (0xffffffff)

/** \\brief  Offset for Ifx_ETH_RXIPV6_HEADER_ERROR_FRAMES_Bits.RXIPV6HDRERRFRM */
#define IFX_ETH_RXIPV6_HEADER_ERROR_FRAMES_RXIPV6HDRERRFRM_OFF (0)

/** \\brief  Length for Ifx_ETH_RXIPV6_HEADER_ERROR_OCTETS_Bits.RXIPV6HDRERROCT */
#define IFX_ETH_RXIPV6_HEADER_ERROR_OCTETS_RXIPV6HDRERROCT_LEN (32)

/** \\brief  Mask for Ifx_ETH_RXIPV6_HEADER_ERROR_OCTETS_Bits.RXIPV6HDRERROCT */
#define IFX_ETH_RXIPV6_HEADER_ERROR_OCTETS_RXIPV6HDRERROCT_MSK (0xffffffff)

/** \\brief  Offset for Ifx_ETH_RXIPV6_HEADER_ERROR_OCTETS_Bits.RXIPV6HDRERROCT */
#define IFX_ETH_RXIPV6_HEADER_ERROR_OCTETS_RXIPV6HDRERROCT_OFF (0)

/** \\brief  Length for Ifx_ETH_RXIPV6_NO_PAYLOAD_FRAMES_Bits.RXIPV6NOPAYFRM */
#define IFX_ETH_RXIPV6_NO_PAYLOAD_FRAMES_RXIPV6NOPAYFRM_LEN (32)

/** \\brief  Mask for Ifx_ETH_RXIPV6_NO_PAYLOAD_FRAMES_Bits.RXIPV6NOPAYFRM */
#define IFX_ETH_RXIPV6_NO_PAYLOAD_FRAMES_RXIPV6NOPAYFRM_MSK (0xffffffff)

/** \\brief  Offset for Ifx_ETH_RXIPV6_NO_PAYLOAD_FRAMES_Bits.RXIPV6NOPAYFRM */
#define IFX_ETH_RXIPV6_NO_PAYLOAD_FRAMES_RXIPV6NOPAYFRM_OFF (0)

/** \\brief  Length for Ifx_ETH_RXIPV6_NO_PAYLOAD_OCTETS_Bits.RXIPV6NOPAYOCT */
#define IFX_ETH_RXIPV6_NO_PAYLOAD_OCTETS_RXIPV6NOPAYOCT_LEN (32)

/** \\brief  Mask for Ifx_ETH_RXIPV6_NO_PAYLOAD_OCTETS_Bits.RXIPV6NOPAYOCT */
#define IFX_ETH_RXIPV6_NO_PAYLOAD_OCTETS_RXIPV6NOPAYOCT_MSK (0xffffffff)

/** \\brief  Offset for Ifx_ETH_RXIPV6_NO_PAYLOAD_OCTETS_Bits.RXIPV6NOPAYOCT */
#define IFX_ETH_RXIPV6_NO_PAYLOAD_OCTETS_RXIPV6NOPAYOCT_OFF (0)

/** \\brief  Length for Ifx_ETH_RXTCP_ERROR_FRAMES_Bits.RXTCPERRFRM */
#define IFX_ETH_RXTCP_ERROR_FRAMES_RXTCPERRFRM_LEN (32)

/** \\brief  Mask for Ifx_ETH_RXTCP_ERROR_FRAMES_Bits.RXTCPERRFRM */
#define IFX_ETH_RXTCP_ERROR_FRAMES_RXTCPERRFRM_MSK (0xffffffff)

/** \\brief  Offset for Ifx_ETH_RXTCP_ERROR_FRAMES_Bits.RXTCPERRFRM */
#define IFX_ETH_RXTCP_ERROR_FRAMES_RXTCPERRFRM_OFF (0)

/** \\brief  Length for Ifx_ETH_RXTCP_ERROR_OCTETS_Bits.RXTCPERROCT */
#define IFX_ETH_RXTCP_ERROR_OCTETS_RXTCPERROCT_LEN (32)

/** \\brief  Mask for Ifx_ETH_RXTCP_ERROR_OCTETS_Bits.RXTCPERROCT */
#define IFX_ETH_RXTCP_ERROR_OCTETS_RXTCPERROCT_MSK (0xffffffff)

/** \\brief  Offset for Ifx_ETH_RXTCP_ERROR_OCTETS_Bits.RXTCPERROCT */
#define IFX_ETH_RXTCP_ERROR_OCTETS_RXTCPERROCT_OFF (0)

/** \\brief  Length for Ifx_ETH_RXTCP_GOOD_FRAMES_Bits.RXTCPGDFRM */
#define IFX_ETH_RXTCP_GOOD_FRAMES_RXTCPGDFRM_LEN (32)

/** \\brief  Mask for Ifx_ETH_RXTCP_GOOD_FRAMES_Bits.RXTCPGDFRM */
#define IFX_ETH_RXTCP_GOOD_FRAMES_RXTCPGDFRM_MSK (0xffffffff)

/** \\brief  Offset for Ifx_ETH_RXTCP_GOOD_FRAMES_Bits.RXTCPGDFRM */
#define IFX_ETH_RXTCP_GOOD_FRAMES_RXTCPGDFRM_OFF (0)

/** \\brief  Length for Ifx_ETH_RXTCP_GOOD_OCTETS_Bits.RXTCPGDOCT */
#define IFX_ETH_RXTCP_GOOD_OCTETS_RXTCPGDOCT_LEN (32)

/** \\brief  Mask for Ifx_ETH_RXTCP_GOOD_OCTETS_Bits.RXTCPGDOCT */
#define IFX_ETH_RXTCP_GOOD_OCTETS_RXTCPGDOCT_MSK (0xffffffff)

/** \\brief  Offset for Ifx_ETH_RXTCP_GOOD_OCTETS_Bits.RXTCPGDOCT */
#define IFX_ETH_RXTCP_GOOD_OCTETS_RXTCPGDOCT_OFF (0)

