HAMES2-1st-3/TunnelComfortSystemTesting/include/tc26xa/IfxEth_bf.h
/** \\brief  Offset for Ifx_ETH_TIMESTAMP_CONTROL_Bits.ATSEN2 */
#define IFX_ETH_TIMESTAMP_CONTROL_ATSEN2_OFF (27)

/** \\brief  Length for Ifx_ETH_TIMESTAMP_CONTROL_Bits.ATSEN3 */
#define IFX_ETH_TIMESTAMP_CONTROL_ATSEN3_LEN (1)

/** \\brief  Mask for Ifx_ETH_TIMESTAMP_CONTROL_Bits.ATSEN3 */
#define IFX_ETH_TIMESTAMP_CONTROL_ATSEN3_MSK (0x1)

/** \\brief  Offset for Ifx_ETH_TIMESTAMP_CONTROL_Bits.ATSEN3 */
#define IFX_ETH_TIMESTAMP_CONTROL_ATSEN3_OFF (28)

/** \\brief  Length for Ifx_ETH_TIMESTAMP_CONTROL_Bits.ATSFC */
#define IFX_ETH_TIMESTAMP_CONTROL_ATSFC_LEN (1)

/** \\brief  Mask for Ifx_ETH_TIMESTAMP_CONTROL_Bits.ATSFC */
#define IFX_ETH_TIMESTAMP_CONTROL_ATSFC_MSK (0x1)

/** \\brief  Offset for Ifx_ETH_TIMESTAMP_CONTROL_Bits.ATSFC */
#define IFX_ETH_TIMESTAMP_CONTROL_ATSFC_OFF (24)

/** \\brief  Length for Ifx_ETH_TIMESTAMP_CONTROL_Bits.SNAPTYPSEL */
#define IFX_ETH_TIMESTAMP_CONTROL_SNAPTYPSEL_LEN (2)

/** \\brief  Mask for Ifx_ETH_TIMESTAMP_CONTROL_Bits.SNAPTYPSEL */
#define IFX_ETH_TIMESTAMP_CONTROL_SNAPTYPSEL_MSK (0x3)

/** \\brief  Offset for Ifx_ETH_TIMESTAMP_CONTROL_Bits.SNAPTYPSEL */
#define IFX_ETH_TIMESTAMP_CONTROL_SNAPTYPSEL_OFF (16)

/** \\brief  Length for Ifx_ETH_TIMESTAMP_CONTROL_Bits.TSADDREG */
#define IFX_ETH_TIMESTAMP_CONTROL_TSADDREG_LEN (1)

/** \\brief  Mask for Ifx_ETH_TIMESTAMP_CONTROL_Bits.TSADDREG */
#define IFX_ETH_TIMESTAMP_CONTROL_TSADDREG_MSK (0x1)

/** \\brief  Offset for Ifx_ETH_TIMESTAMP_CONTROL_Bits.TSADDREG */
#define IFX_ETH_TIMESTAMP_CONTROL_TSADDREG_OFF (5)

/** \\brief  Length for Ifx_ETH_TIMESTAMP_CONTROL_Bits.TSCFUPDT */
#define IFX_ETH_TIMESTAMP_CONTROL_TSCFUPDT_LEN (1)

/** \\brief  Mask for Ifx_ETH_TIMESTAMP_CONTROL_Bits.TSCFUPDT */
#define IFX_ETH_TIMESTAMP_CONTROL_TSCFUPDT_MSK (0x1)

/** \\brief  Offset for Ifx_ETH_TIMESTAMP_CONTROL_Bits.TSCFUPDT */
#define IFX_ETH_TIMESTAMP_CONTROL_TSCFUPDT_OFF (1)

/** \\brief  Length for Ifx_ETH_TIMESTAMP_CONTROL_Bits.TSCTRLSSR */
#define IFX_ETH_TIMESTAMP_CONTROL_TSCTRLSSR_LEN (1)

/** \\brief  Mask for Ifx_ETH_TIMESTAMP_CONTROL_Bits.TSCTRLSSR */
#define IFX_ETH_TIMESTAMP_CONTROL_TSCTRLSSR_MSK (0x1)

/** \\brief  Offset for Ifx_ETH_TIMESTAMP_CONTROL_Bits.TSCTRLSSR */
#define IFX_ETH_TIMESTAMP_CONTROL_TSCTRLSSR_OFF (9)

/** \\brief  Length for Ifx_ETH_TIMESTAMP_CONTROL_Bits.TSENA */
#define IFX_ETH_TIMESTAMP_CONTROL_TSENA_LEN (1)

/** \\brief  Mask for Ifx_ETH_TIMESTAMP_CONTROL_Bits.TSENA */
#define IFX_ETH_TIMESTAMP_CONTROL_TSENA_MSK (0x1)

/** \\brief  Offset for Ifx_ETH_TIMESTAMP_CONTROL_Bits.TSENA */
#define IFX_ETH_TIMESTAMP_CONTROL_TSENA_OFF (0)

/** \\brief  Length for Ifx_ETH_TIMESTAMP_CONTROL_Bits.TSENALL */
#define IFX_ETH_TIMESTAMP_CONTROL_TSENALL_LEN (1)

/** \\brief  Mask for Ifx_ETH_TIMESTAMP_CONTROL_Bits.TSENALL */
#define IFX_ETH_TIMESTAMP_CONTROL_TSENALL_MSK (0x1)

/** \\brief  Offset for Ifx_ETH_TIMESTAMP_CONTROL_Bits.TSENALL */
#define IFX_ETH_TIMESTAMP_CONTROL_TSENALL_OFF (8)

/** \\brief  Length for Ifx_ETH_TIMESTAMP_CONTROL_Bits.TSENMACADDR */
#define IFX_ETH_TIMESTAMP_CONTROL_TSENMACADDR_LEN (1)

/** \\brief  Mask for Ifx_ETH_TIMESTAMP_CONTROL_Bits.TSENMACADDR */
#define IFX_ETH_TIMESTAMP_CONTROL_TSENMACADDR_MSK (0x1)

/** \\brief  Offset for Ifx_ETH_TIMESTAMP_CONTROL_Bits.TSENMACADDR */
#define IFX_ETH_TIMESTAMP_CONTROL_TSENMACADDR_OFF (18)

/** \\brief  Length for Ifx_ETH_TIMESTAMP_CONTROL_Bits.TSEVNTENA */
#define IFX_ETH_TIMESTAMP_CONTROL_TSEVNTENA_LEN (1)

/** \\brief  Mask for Ifx_ETH_TIMESTAMP_CONTROL_Bits.TSEVNTENA */
#define IFX_ETH_TIMESTAMP_CONTROL_TSEVNTENA_MSK (0x1)

/** \\brief  Offset for Ifx_ETH_TIMESTAMP_CONTROL_Bits.TSEVNTENA */
#define IFX_ETH_TIMESTAMP_CONTROL_TSEVNTENA_OFF (14)

/** \\brief  Length for Ifx_ETH_TIMESTAMP_CONTROL_Bits.TSINIT */
#define IFX_ETH_TIMESTAMP_CONTROL_TSINIT_LEN (1)

/** \\brief  Mask for Ifx_ETH_TIMESTAMP_CONTROL_Bits.TSINIT */
#define IFX_ETH_TIMESTAMP_CONTROL_TSINIT_MSK (0x1)

/** \\brief  Offset for Ifx_ETH_TIMESTAMP_CONTROL_Bits.TSINIT */
#define IFX_ETH_TIMESTAMP_CONTROL_TSINIT_OFF (2)

/** \\brief  Length for Ifx_ETH_TIMESTAMP_CONTROL_Bits.TSIPENA */
#define IFX_ETH_TIMESTAMP_CONTROL_TSIPENA_LEN (1)

/** \\brief  Mask for Ifx_ETH_TIMESTAMP_CONTROL_Bits.TSIPENA */
#define IFX_ETH_TIMESTAMP_CONTROL_TSIPENA_MSK (0x1)

/** \\brief  Offset for Ifx_ETH_TIMESTAMP_CONTROL_Bits.TSIPENA */
#define IFX_ETH_TIMESTAMP_CONTROL_TSIPENA_OFF (11)

/** \\brief  Length for Ifx_ETH_TIMESTAMP_CONTROL_Bits.TSIPV4ENA */
#define IFX_ETH_TIMESTAMP_CONTROL_TSIPV4ENA_LEN (1)

/** \\brief  Mask for Ifx_ETH_TIMESTAMP_CONTROL_Bits.TSIPV4ENA */
#define IFX_ETH_TIMESTAMP_CONTROL_TSIPV4ENA_MSK (0x1)

/** \\brief  Offset for Ifx_ETH_TIMESTAMP_CONTROL_Bits.TSIPV4ENA */
#define IFX_ETH_TIMESTAMP_CONTROL_TSIPV4ENA_OFF (13)

/** \\brief  Length for Ifx_ETH_TIMESTAMP_CONTROL_Bits.TSIPV6ENA */
#define IFX_ETH_TIMESTAMP_CONTROL_TSIPV6ENA_LEN (1)

/** \\brief  Mask for Ifx_ETH_TIMESTAMP_CONTROL_Bits.TSIPV6ENA */
#define IFX_ETH_TIMESTAMP_CONTROL_TSIPV6ENA_MSK (0x1)

/** \\brief  Offset for Ifx_ETH_TIMESTAMP_CONTROL_Bits.TSIPV6ENA */
#define IFX_ETH_TIMESTAMP_CONTROL_TSIPV6ENA_OFF (12)

/** \\brief  Length for Ifx_ETH_TIMESTAMP_CONTROL_Bits.TSMSTRENA */
#define IFX_ETH_TIMESTAMP_CONTROL_TSMSTRENA_LEN (1)

/** \\brief  Mask for Ifx_ETH_TIMESTAMP_CONTROL_Bits.TSMSTRENA */
#define IFX_ETH_TIMESTAMP_CONTROL_TSMSTRENA_MSK (0x1)

/** \\brief  Offset for Ifx_ETH_TIMESTAMP_CONTROL_Bits.TSMSTRENA */
#define IFX_ETH_TIMESTAMP_CONTROL_TSMSTRENA_OFF (15)

/** \\brief  Length for Ifx_ETH_TIMESTAMP_CONTROL_Bits.TSTRIG */
#define IFX_ETH_TIMESTAMP_CONTROL_TSTRIG_LEN (1)

/** \\brief  Mask for Ifx_ETH_TIMESTAMP_CONTROL_Bits.TSTRIG */
#define IFX_ETH_TIMESTAMP_CONTROL_TSTRIG_MSK (0x1)

/** \\brief  Offset for Ifx_ETH_TIMESTAMP_CONTROL_Bits.TSTRIG */
#define IFX_ETH_TIMESTAMP_CONTROL_TSTRIG_OFF (4)

/** \\brief  Length for Ifx_ETH_TIMESTAMP_CONTROL_Bits.TSUPDT */
#define IFX_ETH_TIMESTAMP_CONTROL_TSUPDT_LEN (1)

/** \\brief  Mask for Ifx_ETH_TIMESTAMP_CONTROL_Bits.TSUPDT */
#define IFX_ETH_TIMESTAMP_CONTROL_TSUPDT_MSK (0x1)

/** \\brief  Offset for Ifx_ETH_TIMESTAMP_CONTROL_Bits.TSUPDT */
#define IFX_ETH_TIMESTAMP_CONTROL_TSUPDT_OFF (3)

